Repository: qt-labs/vstools
Catalog: Qt4VS2003/QtProjectLib/ProjectLibStringResources.*.resx
Languages: de

source: &Cancel
de: &Abbrechen

source: Export Solution
de: Projektmappe exportieren

source: Open Solution
de: Projektmappe öffnen

# ProjectExists
source: Project file exists!
de: Die Projektdatei existiert bereits!

# ExportProject_CheckFileAndSyntax
source: 1. Check that all the files exists. 2. Check for syntax errors in the pri file.
de: 1. Überprüfen Sie das alle Dateien existieren. 2. Überprüfen Sie die entsprechende .pri Datei auf Syntax Fehler.

# ExportProject_EditProjectFileManually
source: qmake has generated a .vcproj file, but it needs to be converted. To do this you must open the .vcproj file manually. (Reason: qmake in Qt3 does not support generation of Visual Studio 2005 .vcproj files)
de: qmake hat eine .vcproj Datei erzeugt, die noch weiter angepasst werden muss. Um dies zu tun öffnen Sie bitte die entsprechende .vcproj Datei manuell zur Bearbeitung. (Ursache: qmake in Qt3 bietet noch keine Unterstützung um Visual Studio 2005 .vcproj Projektdateien zu generieren)

# ExportProject_ErrorParsingPriFile
source: Error while parsing pri file! ({0})
de: Fehler beim parsen der .pri Datei! ({0})

# ExportProject_ExistsOverwriteQuestion
source: {0} already exists. Do you want to overwrite it?
de: {0} existiert bereits. Soll diese dennoch überschrieben werden?

# ExportProject_ExportPriFile
source: Export to .pri file
de: Export in .pri Datei

# ExportProject_ImportPriFile
source: Import from .pri file
de: Import von .pri Datei

# ExportProject_NoProjectsToExport
source: Did not find any Qt4 projects to export.
de: Es wurde kein Qt4 Projekt zum Export gefunden.

# ExportProject_PriFileContainsSpaces
source: The generated pri file contains paths with spaces. You will not be able to import from this file! 1. Manually edit the generated pri file. 2. Move your project to a location without spaces in the path. 3. Place the pri file in another directory.
de: Die erzeugte .pri Datei enthält Leerzeichen in den Pfadangaben. Der Import aus dieser Datei ist nicht möglich! 1. Bearbeiten Sie die generierte .pri Datei manuell. 2. Verschieben Sie Ihr Projekt in einen Pfad ohne Leerzeichen. 3. Verschieben Sie die .pri Datei in ein anderes Verzeichnis.

# ExportProject_ProjectExistsRegenerateOrReuse
source: {0} already exists! Select 'Yes' to regenerate the file, and 'No' to use the existing one.
de: Die Projektdatei {0} existiert bereits! Wählen Sie 'Ja' um das Projekt neu zu erstellen oder 'Nein' um das existierende beizubehalten.

# ExportProject_ProjectOrSolutionCorrupt
source: {0} (Maybe the .vcproj or .sln file is corrupt?)
de: {0} (Möglicherweise ist die .vcproj oder die .sln Datei beschädigt?)

# ExportProject_SelectQtProjectToAdd
source: Select a Qt Project to add to the Solution
de: Wählen Sie ein Qt Projekt das zur Projektmappe hinzugefügt werden soll...

# ExportProject_SolutionProFileBuildIn
source: Do you want a solution .pro file to be built in {0}?
de: Soll die Projektmappe .pro Datei hier erstellt werden: {0}?

# ExportProject_SubdirsProfileSolutionClose
source: It looks like this is a SUBDIRS .pro file. In order to open this file the existing solution needs to be closed (pending changes will be saved).
de: Bei dieser .pro Datei handelt es sich um eine SUBDIRS .pro Datei. Um diese Datei zu öffnen muss die gerade geöffnete Projektmappe geschlossen werden (anstehende Änderungen werden gespeichert).

# ExportProjectDialog_Cancel
source: &Cancel
de: &Abbrechen

# ExportProjectDialog_CreatePro
source: Create .pro files for:
de: Erstelle .pro Dateien für folgende Projekte:

# ExportProjectDialog_Project
source: Project &tag:
de: Projektelement:

# ExportProjectDialog_Open
source: Open Created Files
de: Öffne erstellte Dateien

# ExportProjectDialog_CreatePri
source: Create .pri File
de: Erstelle .pri Datei

# ExportProjectDialog_Title
source: Export Project
de: Exportiere Projekt

# QMakeProcess_OpenSolutionFromFile
source: Open Solution from File:
de: Generiere Projektmappe von Datei:

# HelperFunctions_TryCreatingNewProject
source: Try creating a new project.
de: Versuche ein neues Projekt zu erstellen.

# HelperFunctions_ErrorSearchForQtTemplatePath
source: An error occured while searching for the Qt templates path.
de: Ein Fehler trat auf während der Suche nach dem Qt Template Pfad.

# HelperFunctions_CannotWriteEnvQTDIR
source: Cannot write environment variable QTDIR.
de: Die Umgebungsvariable QTDIR konnte nicht gesetzt werden.

# Messages_ErrorOccured
source: The following error occured:
de: Der folgende Fehler trat auf:

# Messages_Warning
source: Warning:
de: Warnung:

# Messages_SolveProblem
source: To solve this problem:
de: Dieses Problem muss behoben werden:

# QtProject_CannotConstructWithoutValidProject
source: Cannot construct a QtProject object without a valid project!
de: Es konnte kein Qt Projekt ohne bestehendes Projekt erstellt werden!

# QtProject_CannotAddUicStep
source: Cannot add uic step to file {0}
de: Die uic Bearbeitungsschritte konnten nicht zur Datei: {0} hinzugefügt werden.

# QtProject_CannotAddMocStep
source: Cannot add moc step to file {0}
de: Die moc Bearbeitungsschritte konnten nicht zur Datei: {0} hinzugefügt werden.

# QtProject_CannotRemoveMocStep
source: Cannot remove moc step from file {0}
de: Die moc Bearbeitungsschritte konnten nicht von Datei: {0} entfernt werden.

# QtProject_CannotAddFilter
source: Project can't add filter {0}
de: Das Projekt konnte den Filter: {0} nicht hinzugefügen.

# QtProject_CannotAddFile
source: Cannot add file {0} to filter.
de: Die Datei: {0} konnte nicht zum Filter hinzugefügt werden.

# QtProject_CannotRemoveFile
source: Cannot remove file {0} from filter.
de: Die Datei {0} konnte nicht vom Filter entfernt werden.

# QtProject_DeletedFolderFullOrProteced
source: 1. Maybe your deleted folder is full. 2. Or maybe it's write protected.
de: 1. Möglicherweise ist Ihr "Gelöschte Objekte" Verzeichnis voll. 2. Möglicherweise ist dieses Verzeichnis schreibgeschützt.

# QtProject_CannotFindFilter
source: Cannot find filter.
de: Der Filter wurde nicht gefunden.

# QtProject_ProjectCannotAddFilter
source: Project can't add filter {0}
de: Das Projekt konnte den Filter: {0} nicht hinzugefügen.

# QtProject_ProjectCannotAddResourceFilter
source: Cannot add resource filter.
de: Der Filter für "Resource Dateien" konnte nicht erstellt werden.

# QtProject_CannotCreateResourceDir
source: Cannot create resource directory.
de: Es konnte kein Verzeichnis für "Resource Dateien" erstellt werden.

# QtProject_CannotAdjustWhitespaces
source: Can't adjust whitespaces or tabs in file (write). ({0})
de: Leerzeichen oder Tabstops konnten nicht angepasst werden (write). Datei: ({0})

# QtProject_CannotReplaceTokenRead
source: Can't replace token ({0} -> {1}) in file (read). ({3})
de: Fehler beim Ersetzen von Zeichen ({0} -> {1}) (read). Datei: ({3})

# QtProject_CannotReplaceTokenWrite
source: Can't replace token ({0} -> {1}) in file (write). ({3})
de: Fehler beim Ersetzen von Zeichen ({0} -> {1}) (write). Datei: ({3})

# QtProject_CannotEnableSectionRead
source: Can't enable section {0} in file (read). ({1})
de: Der Abschnitt {0} konnte nicht aktiviert werden (read). Datei: ({1})

# QtProject_CannotEnableSectionWrite
source: Can't enable section {0} in file (write). ({1})
de: Der Abschnitt {0} konnte nicht aktiviert werden (write). Datei: ({1})

# QtProject_CannotUpdateUicStep
source: Cannot update uic steps!
de: Die uic Bearbeitungsschritte konnten nicht aktualisiert werden!

# QtProject_FileExistsInProjectFolder
source: The file {0} existst in your project folder. Visual Studio Add-in will overwrite the existing file! Select 'Yes' to overwrite, select 'No' to keep the existing file and automatically readd it to the project.
de: Die Datei {0} existiert bereits im Projektverzeichnis. Visual Studio Add-in wird diese Datei überschreiben! Wählen Sie 'Ja' um die vorhandene Datei zu ersetzen, wählen Sie 'Nein' um die existierende Datei beizubehalten und diese automatisch wieder dem Projekt hinzuzufügen.

# QtVersionManager_CannotLoadQtVersion
source: Cannot load the default Qt version.
de: Die Standard Qt Version konnte nicht geladen werden.

# Resources_AddQtResource
source: Add Qt Resource
de: Qt Resource hinzufuegen

# Resources_SourceFiles
source: Source Files
de: Source Dateien

# Resources_HeaderFiles
source: Header Files
de: Header Dateien

# Resources_FormFiles
source: Form Files
de: Form Dateien

# Resources_ResourceFiles
source: Resource Files
de: Resource Dateien

# Resources_TranslationFiles
source: Translation Files
de: Lokalisierungs Dateien

# Resources_GeneratedFiles
source: Generated Files
de: Generierte Dateien

# CommandBarNotFound
source: Could not add "Qt" entry to command bar.
de: "Qt" Eintrag konnte nicht zur Befehlsleiste hinzugefügt werden.

# QtProject_CannotFindCustomBuildTool
source: Could not find custom build tool for {0}.
de: Kann Custom Build Tool für {0} nicht finden.

# QtProject_CannotAccessUserFile
source: Could not add QTDIR to {0}'s user file.
de: QTDIR konnte nicht zur User Datei von {0} hinzugefügt werden.

# ImportProject_CannotFindQtDirectory
source: Could not parse QTDIR from project file {0}.
de: QTDIR konnte nicht aus Projektdatei {0} geparst werden.

# Helpers_ExitError
source: The application exited with an error (ExitCode {0}):
de: Die Applikation endete mit einem Fehler (Fehlerkode {0}):
